; domain
(define (domain floor-tile)
  (:requirements :typing)
  (:types
    robot tile color - object
  )

  (:predicates
    (robot-at ?r - robot ?x - tile)
    (up ?x - tile ?y - tile)
    (right ?x - tile ?y - tile)
    (painted ?x - tile ?c - color)
    (robot-has ?r - robot ?c - color)
    (available-color ?c - color)
  )

  (:action change-color
    :parameters (?r - robot ?c - color ?c2 - color)
    :precondition (and (robot-has ?r ?c) (available-color ?c2))
    :effect (and (not (robot-has ?r ?c)) (robot-has ?r ?c2)
    )
  )

  (:action paint-up
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?y ?x))
    :effect  (painted ?y ?c)
  )

  (:action paint-down
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (up ?x ?y))
    :effect (and (painted ?y ?c)
    )
  )

  (:action paint-right
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (right ?y ?x))
    :effect (and (painted ?y ?c)
    )
  )

  (:action paint-left
    :parameters (?r - robot ?y - tile ?x - tile ?c - color)
    :precondition (and (robot-has ?r ?c) (robot-at ?r ?x) (right ?x ?y))
    :effect (and (painted ?y ?c)
    )
  )

  ; Robot movements
  (:action up
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (up ?y ?x))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

  (:action down
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (up ?x ?y))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

  (:action right
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (right ?y ?x))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

  (:action left
    :parameters (?r - robot ?x - tile ?y - tile)
    :precondition (and (robot-at ?r ?x) (right ?x ?y))
    :effect (and (robot-at ?r ?y) (not (robot-at ?r ?x)))
  )

)

; problem
(define (problem floor_tile_fsp_example_problem)
    (:domain floor-tile)
    (:requirements :typing)
    (:objects color1 color2 - color tile1 tile2 tile3 tile4 tile5 tile6 tile7 tile8 tile9 - tile robot1 - robot)
    (:init
        ; Row 1
        (right tile2 tile1) (right tile3 tile2)
        ; Row 2
        (right tile5 tile4) (right tile6 tile5)
        ; Row 3
        (right tile8 tile7) (right tile9 tile8)
        ; Column 1
        (up tile1 tile4) (up tile4 tile7)
        ; Column 2
        (up tile2 tile5) (up tile5 tile8)
        ; Column 3
        (up tile3 tile6) (up tile6 tile9)
        ; Robot 1
        (robot-at robot1 tile1) (robot-has robot1 color1)
        ; Available colors
        (available-color color1) (available-color color2))
    (:goal (and
        ; Direct translation of the goal's natural language description to predicates
        (painted tile1 color1) (painted tile2 color1) (painted tile3 color1)
        (painted tile4 color1) (painted tile5 color2) (painted tile6 color1)
        (painted tile7 color1) (painted tile8 color1) (painted tile9 color1)
    ))
)

; plan
1. (paint-down robot1 tile4 tile1 color1)
   added: (painted tile4 color1)
   goals met: 1 of 9
2. (paint-right robot1 tile2 tile1 color1)
   added: (painted tile2 color1)
   goals met: 2 of 9
3. (down robot1 tile1 tile4)
   deleted: (robot-at robot1 tile1)
   added: (robot-at robot1 tile4)
   goals met: 2 of 9
4. (paint-down robot1 tile7 tile4 color1)
   added: (painted tile7 color1)
   goals met: 3 of 9
5. (paint-up robot1 tile1 tile4 color1)
   added: (painted tile1 color1)
   goals met: 4 of 9
6. (right robot1 tile4 tile5)
   deleted: (robot-at robot1 tile4)
   added: (robot-at robot1 tile5)
   goals met: 4 of 9
7. (paint-down robot1 tile8 tile5 color1)
   added: (painted tile8 color1)
   goals met: 5 of 9
8. (paint-right robot1 tile6 tile5 color1)
   added: (painted tile6 color1)
   goals met: 6 of 9
9. (right robot1 tile5 tile6)
   deleted: (robot-at robot1 tile5)
   added: (robot-at robot1 tile6)
   goals met: 6 of 9
10. (paint-down robot1 tile9 tile6 color1)
   added: (painted tile9 color1)
   goals met: 7 of 9
11. (paint-up robot1 tile3 tile6 color1)
   added: (painted tile3 color1)
   goals met: 8 of 9
12. (change-color robot1 color1 color2)
   deleted: (robot-has robot1 color1)
   added: (robot-has robot1 color2)
   goals met: 8 of 9
13. (paint-left robot1 tile5 tile6 color2)
   added: (painted tile5 color2)
   goals met: 9 of 9
